In [1]:
import pandas as pd
import numpy as np
pop = pd.read_csv('../data/mock_sysselsatte/population_2019_30000.csv')
comp = pd.read_csv('../data/mock_sysselsatte/companies_2019_30000.csv')

### Repetisjon: Indexing inn til en enkelt verdi

In [4]:
pop

,Unnamed: 0,id,work_id,sex,age,year_birth,work_percent
0,0,29101946112,NaN,Menn,0,2019,NaN
1,1,26101930288,NaN,Menn,0,2019,NaN
2,2,22091952214,NaN,Menn,0,2019,NaN
3,3,4071997222,NaN,Menn,0,2019,NaN
4,4,7101970642,NaN,Menn,0,2019,NaN
...,...,...,...,...,...,...,...
29995,29995,15072660901,NaN,Kvinner,93,1926,NaN
29996,29996,23012604128,NaN,Kvinner,93,1926,NaN
29997,29997,14102931680,NaN,Kvinner,90,1929,NaN
29998,29998,29062932768,NaN,Kvinner,90,1929,NaN
29999,29999,11072931487,NaN,Kvinner,90,1929,NaN

In [2]:
# Kolonnenavn først
pop['age'][0]

0

In [3]:
# Radnavn først
pop.loc[0]['sex']

'Menn'

### "Keep"

In [5]:
pop.columns

Index(['Unnamed: 0', 'id', 'work_id', 'sex', 'age', 'year_birth',
       'work_percent'],
      dtype='object')

In [6]:
# Alle kolonnene vi vil beholde, inn i en ny dataframe
pop2 = pop[['sex', 'age', 'work_percent']]
pop2

           sex  age  work_percent
0         Menn    0           NaN
1         Menn    0           NaN
2         Menn    0           NaN
3         Menn    0           NaN
4         Menn    0           NaN
...        ...  ...           ...
29995  Kvinner   93           NaN
29996  Kvinner   93           NaN
29997  Kvinner   90           NaN
29998  Kvinner   90           NaN
29999  Kvinner   90           NaN

[30000 rows x 3 columns]

### "Drop"

In [7]:
# ALle kolonnene vi vil beholde, untatt
pop3 = pop.drop('age', axis = 1)

In [8]:
pop3

       Unnamed: 0           id  work_id      sex  year_birth  work_percent
0               0  29101946112      NaN     Menn        2019           NaN
1               1  26101930288      NaN     Menn        2019           NaN
2               2  22091952214      NaN     Menn        2019           NaN
3               3   4071997222      NaN     Menn        2019           NaN
4               4   7101970642      NaN     Menn        2019           NaN
...           ...          ...      ...      ...         ...           ...
29995       29995  15072660901      NaN  Kvinner        1926           NaN
29996       29996  23012604128      NaN  Kvinner        1926           NaN
29997       29997  14102931680      NaN  Kvinner        1929           NaN
29998       29998  29062932768      NaN  Kvinner        1929           NaN
29999       29999  11072931487      NaN  Kvinner        1929           NaN

[30000 rows x 6 columns]

### .columns / .keys()

In [9]:
pop.columns

Index(['Unnamed: 0', 'id', 'work_id', 'sex', 'age', 'year_birth',
       'work_percent'],
      dtype='object')

In [10]:
pop.keys()

Index(['Unnamed: 0', 'id', 'work_id', 'sex', 'age', 'year_birth',
       'work_percent'],
      dtype='object')

##### Bonus: rename kolonner kun med .columns

In [12]:
pop.columns[0] = 'ja'

TypeError: Index does not support mutable operations

In [ ]:
change_names = list(pop.columns)
change_names[0] = 'delete_me' 
pop.columns = change_names

In [ ]:
pop.columns

### .rename()

In [13]:
# Rename tar en dict, som er veldig fint
renaming = {
    'sex' : 'kjoenn',
    'age' : 'alder'
}
pop.rename(renaming, axis = "columns")

,Unnamed: 0,id,work_id,kjoenn,alder,year_birth,work_percent
0,0,29101946112,NaN,Menn,0,2019,NaN
1,1,26101930288,NaN,Menn,0,2019,NaN
2,2,22091952214,NaN,Menn,0,2019,NaN
3,3,4071997222,NaN,Menn,0,2019,NaN
4,4,7101970642,NaN,Menn,0,2019,NaN
...,...,...,...,...,...,...,...
29995,29995,15072660901,NaN,Kvinner,93,1926,NaN
29996,29996,23012604128,NaN,Kvinner,93,1926,NaN
29997,29997,14102931680,NaN,Kvinner,90,1929,NaN
29998,29998,29062932768,NaN,Kvinner,90,1929,NaN
29999,29999,11072931487,NaN,Kvinner,90,1929,NaN

### .replace()
Erstatt verdier i en eller flere kolonner

In [14]:
# En dict av dicts med kolonnenavn : dict( fra : til )
val_rep = {
    'sex' : {
        'Menn' : 1,
        'Kvinner' : 2
    },
    'age' : {
        0 : np.nan
    }
}

In [15]:
pop.replace(val_rep)

       Unnamed: 0           id  work_id  sex   age  year_birth  work_percent
0               0  29101946112      NaN    1   NaN        2019           NaN
1               1  26101930288      NaN    1   NaN        2019           NaN
2               2  22091952214      NaN    1   NaN        2019           NaN
3               3   4071997222      NaN    1   NaN        2019           NaN
4               4   7101970642      NaN    1   NaN        2019           NaN
...           ...          ...      ...  ...   ...         ...           ...
29995       29995  15072660901      NaN    2  93.0        1926           NaN
29996       29996  23012604128      NaN    2  93.0        1926           NaN
29997       29997  14102931680      NaN    2  90.0        1929           NaN
29998       29998  29062932768      NaN    2  90.0        1929           NaN
29999       29999  11072931487      NaN    2  90.0        1929           NaN

[30000 rows x 7 columns]